app/controllers/articles_controller.rb

UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2021-03-17 03:28:56.353321"], ["id", 1]]
---
  def update
    edit
    @article.update(title: params[:article][:title], description: params[:article][:description])